cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1237H6PM.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HIB</name>
      <description>Register map for HIB peripheral</description>
      <groupName>HIB</groupName>
      <prependToName>HIB</prependToName>
      <baseAddress>0x400FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>HIB</name><value>43</value></interrupt>
      <registers>
        <register>
          <name>RTCC</name>
          <description>Hibernation RTC Counter</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCC</name>
              <description>RTC Counter</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCM0</name>
          <description>Hibernation RTC Match 0</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCM0</name>
              <description>RTC Match 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCLD</name>
          <description>Hibernation RTC Load</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCLD</name>
              <description>RTC Load</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Hibernation Control</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>HIB_CTL_RTCEN</name>
              <description>RTC Timer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_HIBREQ</name>
              <description>Hibernation Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_RTCWEN</name>
              <description>RTC Wake-up Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_PINWEN</name>
              <description>External WAKE Pin Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_CLK32EN</name>
              <description>Clocking Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VABORT</name>
              <description>Power Cut Abort Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VDD3ON</name>
              <description>VDD Powered</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_BATWKEN</name>
              <description>Wake on Low Battery</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_BATCHK</name>
              <description>Check Battery Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VBATSEL</name>
              <description>Select for Low-Battery Comparator</description>
              <bitRange>[14:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_1_9V</name>
                  <description>1.9 Volts</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_1V</name>
                  <description>2.1 Volts (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_3V</name>
                  <description>2.3 Volts</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_5V</name>
                  <description>2.5 Volts</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIB_CTL_OSCBYP</name>
              <description>Oscillator Bypass</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_OSCDRV</name>
              <description>Oscillator Drive Capability</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_WRC</name>
              <description>Write Complete/Capable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>Hibernation Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>HIB_IM_RTCALT0</name>
              <description>RTC Alert 0 Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_IM_LOWBAT</name>
              <description>Low Battery Voltage Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_IM_EXTW</name>
              <description>External Wake-Up Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_IM_WC</name>
              <description>External Write Complete/Capable Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Hibernation Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>HIB_RIS_RTCALT0</name>
              <description>RTC Alert 0 Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_LOWBAT</name>
              <description>Low Battery Voltage Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_EXTW</name>
              <description>External Wake-Up Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_WC</name>
              <description>Write Complete/Capable Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Hibernation Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>HIB_MIS_RTCALT0</name>
              <description>RTC Alert 0 Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_LOWBAT</name>
              <description>Low Battery Voltage Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_EXTW</name>
              <description>External Wake-Up Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_WC</name>
              <description>Write Complete/Capable Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>Hibernation Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>HIB_IC_RTCALT0</name>
              <description>RTC Alert0 Masked Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_IC_LOWBAT</name>
              <description>Low Battery Voltage Masked Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_IC_EXTW</name>
              <description>External Wake-Up Masked Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_IC_WC</name>
              <description>Write Complete/Capable Masked Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCT</name>
          <description>Hibernation RTC Trim</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCT_TRIM</name>
              <description>RTC Trim Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSS</name>
          <description>Hibernation RTC Sub Seconds</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCSS_RTCSSC</name>
              <description>RTC Sub Seconds Count</description>
              <bitRange>[14:0]</bitRange>
            </field>
            <field>
              <name>HIB_RTCSS_RTCSSM</name>
              <description>RTC Sub Seconds Match</description>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Hibernation Data</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>HIB_DATA_RTD</name>
              <description>Hibernation Module NV Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
